[
    {
      "type": "iso",
      "images": ["iso_darker.png", "iso_brighter.png"],
      "correct": 1,
      "feedback": {
        "correct": "✔ Correct! Higher ISO = brighter photo.",
        "incorrect": "✕ Oops! Lower ISO results in a darker image."
      }
    },
    {
      "type": "shutter",
      "image": "shutter_speed.png",
      "options": [
        {
          "value": "0",
          "text": "1/2000s",
          "feedback": "✗ Too fast to capture light trails.<br> A shutter speed like 1/2000s is extremely fast — it would freeze any motion completely. You would see distinct car shapes or headlights, not long continuous light streaks."
        },
        {
          "value": "1",
          "text": "1/60s",
          "feedback": "✗ Still too fast for light trails.<br> While 1/60s is slower than 1/2000s, it's still not long enough to create smooth, extended light trails. You might get a bit of blur, but not the dramatic streaks seen in the photo."
        },
        {
          "value": "2",
          "text": "2s",
          "feedback": "✔ Correct!<br> A shutter speed of 2 seconds allows the camera to capture moving car lights over time, resulting in continuous light trails. This is a common technique in night photography."
        }
      ],
      "correct": 2
    },
    {
      "type": "matching",
      "subquestions": [
        {
          "scene": "Portrait (shallow background)",
          "options": [
            "ISO 3200 | f/2.0 | 1/30s",
            "ISO 100  | f/1.8 | 1/250s",
            "ISO 800  | f/5.6 | 1/125s"
          ],
          "correct": 1,
          "explanation": "Correct! Low ISO + wide aperture for shallow depth of field"
        },
        {
          "scene": "Landscape (full focus)",
          "options": [
            "ISO 100 | f/11  | 1/250s",
            "ISO 800 | f/4.0 | 1/1000s",
            "ISO 200 | f/5.6 | 1/500s"
          ],
          "correct": 0,
          "explanation": "Correct! This setting uses a low ISO for maximum image quality, a narrow aperture (f/11) to keep the entire landscape in sharp focus (deep depth of field), and a moderately fast shutter speed (1/250s) to avoid motion blur — ideal for bright outdoor scenes."
        },
        {
          "scene": "Night street (handheld)",
          "options": [
            "ISO 100  | f/11  | 2s",
            "ISO 3200 | f/2.0 | 1/30s",
            "ISO 800  | f/5.6 | 1/2s"
          ],
          "correct": 1,
          "explanation": "Correct! In low-light conditions, this combination provides a high ISO to brighten the image, a wide aperture (f/2.0) to gather more light, and a shutter speed (1/30s) that's just fast enough for handheld shooting without blur — making it the most practical choice at night."
        }
      ]
    }
  ]
  